Autodesk.Revit.DB.SelectionFilterElement.RemoveSet(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Removes a set of ElementIds from the filter's set.
ids:
The set of ElementIds to remove.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.SelectionFilterElement.AddSet(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Adds a set of ElementIds to the filter's set.
ids:
The set of ElementIds to add.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.SelectionFilterElement.SetElementIds(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Replaces the set of ElementIds contained by this filter.
ids:
The new set of ElementIds.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.SelectionFilterElement.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new SelectionFilterElement in the given document.
document:
The document in which to create the SelectionFilterElement.
name:
The name for the new SelectionFilterElement.
Returns:
The new SelectionFilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
-or-
The given value for name is already in use as a filter element name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013